#install.packages("sas7bdat")

library(tidyverse)
library(sas7bdat)


#Data Load
df = read.sas7bdat('koweps_h17_2022_Beta1.sas7bdat')


#필요변수 추출 : 일단 가구주를 기준으로 추출, 각 행이 가구 하나하나임, 같은 가구 패널 ID를 갖는 건 1차년도 때 한 가구였지만 현재 분가 등의 이유로 독립된 가구가 된 것


df = df %>% 
  select(h17_hc_n_all, h1701_5, h1701_6, h1701_11, h1701_110,
         h1706_1, h1706_3, h1707_9, h1708_114, h1708_122, h1708_148, h1708_164,
         h1708_170, h1713_2, h1713_6, h1713_10, h1713_14, h1713_18, h1713_22, h1713_26,
         h1713_8aq1, h1713_5aq1, h1713_8aq2, h1713_15aq1, h1714_4, h1714_8, h1714_12, h1714_16,
         h1714_20, h1714_24, h1714_28, h1714_32, h1714_36, h1714_3aq1, h1714_4aq1,
         h1715_14aq1, h1715_4, h1715_8, h1715_12, h1715_20, h1715_25, h1715_29, h1715_33, h1715_37,
         h1715_4aq1, h1715_7aq1)

colnames(df) = c('저소득층여부','태어난연도','교육수준','혼인상태','가구형태',
                 '주택유형','주택점유형태','총생활비','상용소득','일용소득',
                 '고용및자영소득','농림축산업소득','어업소득', '가구_1','가구_2','가구_3','가구_4',
                 '가구_5','가구_6','가구_7','가구_8','가구_9',
                 '가구_10','가구_11','노인_1','노인_2','노인_3','노인_4','노인_5','노인_6','노인_7',
                 '노인_8','노인_9','노인_10','노인_11','아동_1','아동_2','아동_3','아동_4','아동_5',
                 '아동_6','아동_7','아동_8','아동_9','아동_10','아동_11')

colSums(is.na(df))

#전처리

df = df %>% 
  mutate(나이 = 2023 - 태어난연도) %>% 
  select(-태어난연도)
 
df = df %>% 
  mutate(저소득층여부 = case_when(저소득층여부 == 1 ~ '일반가구',
                            저소득층여부 == 2 ~ '저소득층가구',
                            TRUE ~ NA_character_),
         교육수준 = case_when(교육수준 == 1 ~ '미취학',
                          교육수준 == 2 ~ '무학',
                          교육수준 == 3 ~ '초등',
                          교육수준 == 4 ~ '중등',
                          교육수준 == 5 ~ '고등',
                          교육수준 == 6 ~ '전문대',
                          교육수준 == 7 ~ '대학',
                          교육수준 == 8 ~ '대학원(석사)',
                          교육수준 == 9 ~ '대학원(박사)',
                          TRUE ~ NA_character_),
         혼인상태 = case_when(혼인상태 == 0 ~ '비해당',
                          혼인상태 == 1 ~ '유배우',
                          혼인상태 == 2 ~ '사별',
                          혼인상태 == 3 ~ '이혼',
                          혼인상태 == 4 ~ '별거',
                          혼인상태 == 5 ~ '미혼',
                          혼인상태 == 6 ~ '기타(사망등)',
                          TRUE ~ NA_character_),
         가구형태 = case_when(가구형태 == 1 ~ '단독',
                          가구형태 == 2 ~ '모자',
                          가구형태 == 3 ~ '부자',
                          가구형태 == 4 ~ '조손가구및소년소녀가장',
                          가구형태 == 5 ~ '기타',
                          TRUE ~ NA_character_),
         주택유형 = case_when(주택유형 == 1 ~ '일반단독주택',
                          주택유형 == 2 ~ '다가구용단독주택',
                          주택유형 == 3 ~ '다세대주택',
                          주택유형 == 4 ~ '빌라',
                          주택유형 == 5 ~ '일반아파트',
                          주택유형 == 6 ~ '영구임대아파트',
                          주택유형 == 7 ~ '복합용도주택',
                          주택유형 == 8 ~ '비거주용건물내주택',
                          주택유형 == 9 ~ '오피스텔',
                          주택유형 == 10 ~ '비닐하우스움막',
                          주택유형 == 11 ~ '임시가건물',
                          주택유형 == 12 ~ '기타',
                          주택유형 == 13 ~ '국민공공임대아파트',
                          TRUE ~ NA_character_),
         주택점유형태 = case_when(주택점유형태 == 1 ~ '자가',
                            주택점유형태 == 2 ~ '전세',
                            주택점유형태 == 3 ~ '보증부월세',
                            주택점유형태 == 4 ~ '월세',
                            주택점유형태 == 5 ~ '비가구원명의주택',
                            주택점유형태 == 6 ~ '기타',
                            TRUE ~ NA_character_)
         )


df = df %>% 
  mutate(상용소득 = ifelse(is.na(상용소득),0,상용소득),
         일용소득 = ifelse(is.na(일용소득),0,일용소득),
         고용및자영소득 = ifelse(is.na(고용및자영소득),0,고용및자영소득),
         농림축산업소득 = ifelse(is.na(농림축산업소득),0,농림축산업소득),
         어업소득 = ifelse(is.na(어업소득),0,어업소득),
         총소득 = 상용소득 + 일용소득 + 고용및자영소득 + 농림축산업소득 + 어업소득,
         총생활비 = 총생활비*12)

df = df %>% 
  mutate(가구_1 = ifelse(가구_1 == 1, 1, 0),
         가구_2 = ifelse(가구_2 == 1, 1, 0),
         가구_3 = ifelse(가구_3 == 1, 1, 0),
         가구_4 = ifelse(가구_4 == 1, 1, 0),
         가구_5 = ifelse(가구_5 == 1, 1, 0),
         가구_6 = ifelse(가구_6 == 1, 1, 0),
         가구_7 = ifelse(가구_7 == 1, 1, 0),
         가구_8 = ifelse(가구_8 == 1, 1, 0),
         가구_9 = ifelse(가구_9 == 1, 1, 0),
         가구_10 = ifelse(가구_10 == 1, 1, 0),
         가구_11 = ifelse(가구_11 == 1, 1, 0),
         
         노인_1 = ifelse(is.na(노인_1), 1000, ifelse(노인_1 == 1, 1, 0)),
         노인_2 = ifelse(is.na(노인_2), 1000, ifelse(노인_2 == 1, 1, 0)),
         노인_3 = ifelse(is.na(노인_3), 1000, ifelse(노인_3 == 1, 1, 0)),
         노인_4 = ifelse(is.na(노인_4), 1000, ifelse(노인_4 == 1, 1, 0)),
         노인_5 = ifelse(is.na(노인_5), 1000, ifelse(노인_5 == 1, 1, 0)),
         노인_6 = ifelse(is.na(노인_6), 1000, ifelse(노인_6 == 1, 1, 0)),
         노인_7 = ifelse(is.na(노인_7), 1000, ifelse(노인_7 == 1, 1, 0)),
         노인_8 = ifelse(is.na(노인_8), 1000, ifelse(노인_8 == 1, 1, 0)),
         노인_9 = ifelse(is.na(노인_9), 1000, ifelse(노인_9 == 1, 1, 0)),
         노인_10 = ifelse(is.na(노인_10), 1000, ifelse(노인_10 == 1, 1, 0)),
         노인_11 = ifelse(is.na(노인_11), 1000, ifelse(노인_11 == 1, 1, 0)),
         
         아동_1 = ifelse(is.na(아동_1), 1000, ifelse(아동_1 == 1, 1, 0)),
         아동_2 = ifelse(is.na(아동_2), 1000, ifelse(아동_2 == 1, 1, 0)),
         아동_3 = ifelse(is.na(아동_3), 1000, ifelse(아동_3 == 1, 1, 0)),
         아동_4 = ifelse(is.na(아동_4), 1000, ifelse(아동_4 == 1, 1, 0)),
         아동_5 = ifelse(is.na(아동_5), 1000, ifelse(아동_5 == 1, 1, 0)),
         아동_6 = ifelse(is.na(아동_6), 1000, ifelse(아동_6 == 1, 1, 0)),
         아동_7 = ifelse(is.na(아동_7), 1000, ifelse(아동_7 == 1, 1, 0)),
         아동_8 = ifelse(is.na(아동_8), 1000, ifelse(아동_8 == 1, 1, 0)),
         아동_9 = ifelse(is.na(아동_9), 1000, ifelse(아동_9 == 1, 1, 0)),
         아동_10 = ifelse(is.na(아동_10), 1000, ifelse(아동_10 == 1, 1, 0)),
         아동_11 = ifelse(is.na(아동_11), 1000, ifelse(아동_11 == 1, 1, 0))
  )

df = df %>% 
  mutate(가구서비스 = ifelse(가구_1+가구_2+가구_3+가구_4+가구_5+가구_6+가구_7+가구_8+가구_9+가구_10+가구_11 >= 1, '이용', '미이용'),
         노인서비스 = ifelse(노인_1 == 1000, '해당없음', ifelse(노인_1+노인_2+노인_3+노인_4+노인_5+노인_6+노인_7+노인_8+노인_9+노인_10+노인_11 >= 1, '이용', '미이용')),
         아동서비스 = ifelse(아동_1 == 1000, '해당없음', ifelse(아동_1+아동_2+아동_3+아동_4+아동_5+아동_6+아동_7+아동_8+아동_9+아동_10+아동_11 >= 1, '이용', '미이용'))) %>% 
  select(저소득층여부,나이,교육수준,혼인상태,가구형태,
         주택유형,주택점유형태,총생활비,총소득,가구서비스,노인서비스,아동서비스)


write.csv(df, file = "rawdata.csv", row.names = F)


